// 3.1 데이터와 자료형
/*
	정수 자료형 : 정수값을 저장하는 자료형
	
	정수 자료형			|	저장 공간 크기[Byte]	|	값의 범위
	char			|			1			|	-128 ~ 127
	unsigned char		|			1			|	0 ~ 255
	signed char		|			1			|	-128 ~ 127
	short			|			2			|	-32,768 ~ 32,767
	unsigned short		|			2			|	0 ~ 65,535
	int			|		4			|	-2,147,483,648 ~ 2,147,483,647
	unsigned int		|		4			|	0 ~ 4,294,967,295
	long			|			4			|	-2,147,483,648 ~ 2,147,483,647
	unsigned long		|			4			|	0 ~ 4,294,967,295
	long long		|			8			|	-9,223,372,036,854,775,808 ~ +9,223,372,036,854,775,807
	unsigned long long	|			8			|	0 ~ +18,446,744,073,709,551,615


	실수 자료형 : 실수값을 저장하는 자료형

	실수 자료형			|	저장 공간 크기[Byte]			|	값의 범위			|	십진수 정밀도
	float			|			4			|	1.2E-38 ~ 3.4E+38		|		6자리
	double			|			8			|	2.3E-308 ~ 1.7E+308		|		15자리
	long double		|			10			|	3.4E-4932 ~ 1.1E+4932		|		19자리

*/

#include <stdio.h>
int main()
{
	return 0;
};
